** Clojure Library

 #+BEGIN_SRC clojure :exports both
   (ns hello-world.core
     (:require [org-parser.parser :refer [parse]])
     (:require [org-parser.core :refer [read-str write-str]]))
   
   (parse "* Headline")
   
   (read-str "* Headline")
   (write-str (read-str "* Headline"))
 #+END_SRC

 #+RESULTS:
 | [:S [:headline [:stars "*"] [:text [:text-normal "Headline"]]]]                               |
 | {:headlines [{:headline {:level 1, :title [[:text-normal "Headline"]], :planning [], :tags []}}]} |
 | "* Headline\n"                                                                                |

** Clojure

Run =lein run file.org=, for example:

#+begin_src sh :results verbatim :exports both
  lein run test/org_parser/fixtures/schedule_with_repeater.org
#+end_src

#+RESULTS:
: {:headlines [{:headline {:level 1, :title [[:text-sty-bold "Header"] [:text-normal " with repeater"]], :planning [[:planning-info [:planning-keyword [:planning-kw-scheduled]] [:timestamp-active [:ts-inner [:ts-inner-wo-time [:ts-date "2019-11-27"] [:ts-day "Wed"]] [:ts-modifiers [:ts-repeater [:ts-repeater-type "+"] [:ts-mod-value "1"] [:ts-mod-unit "d"]]]]]]], :tags []}}]}

** NodeJS

First, compile =org-parser= with:

#+begin_src sh :exports code :results silent :tangle buildjs.sh
  lein cljsbuild once main && chmod +x ./target/org-parser.js
#+end_src

Then run =./target/org-parser.js file.org=, for example:

#+begin_src sh :results verbatim :exports both :tangle testjs.sh
  ./target/org-parser.js test/org_parser/fixtures/schedule_with_repeater.org
#+end_src

#+RESULTS:
: {"headlines":[{"headline":{"level":1,"title":[["text-sty-bold","Header"],["text-normal"," with repeater"]],"planning":[["planning-info",["planning-keyword",["planning-kw-scheduled"]],["timestamp-active",["ts-inner",["ts-inner-wo-time",["ts-date","2019-11-27"],["ts-day","Wed"]],["ts-modifiers",["ts-repeater",["ts-repeater-type","+"],["ts-mod-value","1"],["ts-mod-unit","d"]]]]]]],"tags":[]}}]}

** Java

First, compile =org-parser= with:

#+begin_src sh :exports code :results silent :tangle buildjar.sh
  lein uberjar
#+end_src

Then run =java -jar target/uberjar/org-parser-*-SNAPSHOT-standalone.jar file.org=, for example:

#+begin_src sh :results verbatim :exports both :tangle testjar.sh
  java -jar target/uberjar/org-parser-*-SNAPSHOT-standalone.jar test/org_parser/fixtures/schedule_with_repeater.org
#+end_src

#+RESULTS:
: {:headlines [{:headline {:level 1, :title [[:text-sty-bold "Header"] [:text-normal " with repeater"]], :planning [[:planning-info [:planning-keyword [:planning-kw-scheduled]] [:timestamp-active [:ts-inner [:ts-inner-wo-time [:ts-date "2019-11-27"] [:ts-day "Wed"]] [:ts-modifiers [:ts-repeater [:ts-repeater-type "+"] [:ts-mod-value "1"] [:ts-mod-unit "d"]]]]]]], :tags []}}]}

Note: The =*= character must be replaced with the current version number of org-parser.
See the clojars badge at the [[https://github.com/200ok-ch/org-parser#general][top of this README]].

